# 颜色表格字典格式
# 结构: {颜色系统: {饱和度级别: RGB元组}}

color_table = {
    # 红色系 - 非凡洋红(2023年度色), 烈火红, 水晶玫瑰粉
    "red": {
        "high": (255, 179, 191),   # 亮度最高
        "medium": (255, 179, 179), # 亮度最高
        "low": (255, 242, 242)     # 亮度最高
    },
    # 橙色系 - 柚子色, 琥珀之光, 柔和桃(2024年度色)
    "orange": {
        "high": (255, 209, 179),   # 亮度最高
        "medium": (255, 223, 204), # 亮度最高
        "low": (255, 242, 230)     # 亮度最高
    },
    # 黄色系 - 帝国黄, 亮丽黄(2021年度色), 香草奶油粉
    "yellow": {
        "high": (255, 247, 204),   # 亮度最高
        "medium": (255, 249, 204), # 亮度最高
        "low": (255, 252, 242)     # 亮度最高
    },
    # 绿色系 - 经典绿, 韭菜绿, 爱情鸟绿
    "green": {
        "high": (219, 255, 237),   # 亮度最高
        "medium": (234, 255, 242), # 亮度最高
        "low": (231, 255, 239)     # 亮度最高
    },
    # 水蓝色系 - 蓝绿, 夏日之歌蓝, 天窗蓝
    "aqua": {
        "high": (204, 255, 247),   # 亮度最高
        "medium": (217, 255, 255), # 亮度最高
        "low": (217, 255, 255)     # 亮度最高
    },
    # 蓝色系 - 经典蓝(2020年度色), 海军蓝, 长春花蓝(2022年度色)
    "blue": {
        "high": (204, 229, 255),   # 亮度最高
        "medium": (220, 229, 255), # 亮度最高
        "low": (217, 217, 255)     # 亮度最高
    },
    # 紫色系 - 紫,  薰衣草紫, 紫水晶紫
    "purple": {
        "high": (160,32,240),   # 亮度最高
        "medium": (181,126,220), # 亮度最高
        "low": (255, 229, 255)     # 亮度最高
    }

}
